src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаЭлементаIPТелефония/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Свойство("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		Объект.КлючПриложения = Новый УникальныйИдентификатор();
		СформироватьНаименование();
		Если ЗначениеЗаполнено(Объект.ТипВнешнейСистемы) Тогда
			Элементы.ТипВнешнейСистемы.Видимость = Ложь;
		Иначе
			Элементы.ТипВнешнейСистемы.Видимость = Истина;
		КонецЕсли;
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
		Элементы.ТипВнешнейСистемы.Видимость = Ложь;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура("ОтображениеКонтактнойИнформации");
	ИначеЕсли Не ПараметрыВнешнейСистемы.Свойство("ОтображениеКонтактнойИнформации") Тогда
		ПараметрыВнешнейСистемы.Вставить("ОтображениеКонтактнойИнформации");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаВнешняяСистема", Новый Структура("ВнешняяСистема, ТипВнешнейСистемы", Объект.Ссылка, Объект.ТипВнешнейСистемы));
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанаВнешняяСистема" Тогда
		
		ЭтаФорма.Прочитать();
		Этаформа.ОбновитьОтображениеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();

	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Вы точнохотите пометить на удаление данный элемент справочника?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, 
        КодВозвратаДиалога.Да
    );    
 
	
КонецПроцедуры

 &НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
	    ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
        ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);

		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
		ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
		ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
		ВнешняяСистемаОбъект.Используется = Ложь;
		
		Попытка
			ВнешняяСистемаОбъект.Записать();
		Исключение 
 		КонецПопытки;
		
КонецПроцедуры

#КонецОбласти
